{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D81","trainable":true,"batch_input_shape":[null,192,192,3],"dtype":"float32"}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D49","trainable":true}},{"class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7,7],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D82","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[7,7],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D83","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D50","trainable":true}},{"class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[9,9],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D84","trainable":true}},{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[9,9],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D85","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D51","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten17","trainable":true}},{"class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"dropout_Dropout17","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense33","trainable":true}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense34","trainable":true}}],"keras_version":"tfjs-layers 0.10.3","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D81/kernel","shape":[5,5,3,8],"dtype":"float32"},{"name":"conv2d_Conv2D81/bias","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D82/kernel","shape":[7,7,8,16],"dtype":"float32"},{"name":"conv2d_Conv2D82/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D83/kernel","shape":[7,7,16,8],"dtype":"float32"},{"name":"conv2d_Conv2D83/bias","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D84/kernel","shape":[9,9,8,16],"dtype":"float32"},{"name":"conv2d_Conv2D84/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D85/kernel","shape":[9,9,16,8],"dtype":"float32"},{"name":"conv2d_Conv2D85/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense33/kernel","shape":[1152,50],"dtype":"float32"},{"name":"dense_Dense33/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense34/kernel","shape":[50,4],"dtype":"float32"},{"name":"dense_Dense34/bias","shape":[4],"dtype":"float32"}]}]}